armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <book name="Documentation/DM00086815.pdf" title="STM32F401xB/401xC Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="48"/>
          <feature type="SPI"           n="3"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VC'  ***************************** -->
        <device Dname="STM32F401VC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xC"/>

          <book name="Documentation/DM00086815.pdf" title="STM32F401xB/401xC Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VCHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401CD'  ***************************** -->
        <device Dname="STM32F401CD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401CDUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CDYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RD'  ***************************** -->
        <device Dname="STM32F401RD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401RDTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VD'  ***************************** -->
        <device Dname="STM32F401VD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_384.FLM"   start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401VDTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VDHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401CE'  ***************************** -->
        <device Dname="STM32F401CE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug svd="CMSIS/SVD/STM32F401xE.svd"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401CEUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F401CEYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401RE'  ***************************** -->
        <device Dname="STM32F401RE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug svd="CMSIS/SVD/STM32F401xE.svd"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F401VE'  ***************************** -->
        <device Dname="STM32F401VE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F401xE"/>
          <debug svd="CMSIS/SVD/STM32F401xE.svd"/>

          <book name="Documentation/DM00102166.pdf" title="STM32F401xD/401xE Data Sheet"/>

          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="79"/>
          <feature type="SPI"           n="4"       m="42000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F401VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F401VEHx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F410'  **************************** -->
      <subFamily DsubFamily="STM32F410">
        <processor Dclock="100000000"/>
        <debug     svd="CMSIS/SVD/STM32F410xx.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F410.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
          __var TraceClk_Pin   = 0x00020006;   // PC6
          __var TraceD0_Pin    = 0x0002000A;   // PC10
          __var TraceD1_Pin    = 0x0002000B;   // PC11
          __var TraceD2_Pin    = 0x0002000C;   // PC12
          __var TraceD3_Pin    = 0x0001000B;   // PB11
        </debugvars>

