armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <book name="Documentation/DM00180366.pdf" title="STM32F410 Reference Manual"/>
        <book name="Documentation/DM00214043.pdf" title="STM32F410x8/STM32F410xB Data Sheet"/>

        <!-- *************************  Device 'STM32F410CB'  ***************************** -->
        <device Dname="STM32F410CB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Cx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <variant Dvariant="STM32F410CBUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32F410CBTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410RB'  ***************************** -->
        <device Dname="STM32F410RB">

        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Rx"/>
          <memory id="IROM1"                                      start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <variant Dvariant="STM32F410RBTx"> <feature type="QFP" n="64"/> </variant>

          <variant Dvariant="STM32F410RBIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410TB'  ***************************** -->
        <device Dname="STM32F410TB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Tx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <variant Dvariant="STM32F410TBYx"> <feature type="CSP" n="36"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410C8'  ***************************** -->
        <device Dname="STM32F410C8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Cx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <variant Dvariant="STM32F410C8Ux"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32F410C8Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410R8'  ***************************** -->
        <device Dname="STM32F410R8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Rx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <variant Dvariant="STM32F410R8Tx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F410R8Ix"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410T8'  ***************************** -->
        <device Dname="STM32F410T8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Tx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_128.FLM"         start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <variant Dvariant="STM32F410T8Yx"> <feature type="CSP" n="36"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F411'  **************************** -->
      <subFamily DsubFamily="STM32F411">
        <processor Dclock="100000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F411xE"/>
        <debug      svd="CMSIS/SVD/STM32F411xx.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F401xBCDE_411xCE.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

