armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <book name="Documentation/DM00119316.pdf" title="STM32F411xC/E Reference Manual"/>
        <book name="Documentation/DM00115249.pdf" title="STM32F411xC/411xE Data Sheet"/>

        <feature type="Timer"         n="6"       m="16"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="3"       m="10500000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F411CC'  ***************************** -->
        <device Dname="STM32F411CC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411CCUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F411CCYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411RC'  ***************************** -->
        <device Dname="STM32F411RC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411VC'  ***************************** -->
        <device Dname="STM32F411VC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="81"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F411VCHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411CE'  ***************************** -->
        <device Dname="STM32F411CE">
          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411CEUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F411CEYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411RE'  ***************************** -->
        <device Dname="STM32F411RE">
          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411VE'  ***************************** -->
        <device Dname="STM32F411VE">
          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F411xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="81"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F411VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F411VEHx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F412'  **************************** -->
      <subFamily DsubFamily="STM32F412">
        <processor Dclock="100000000"/>
        <debug svd="CMSIS/SVD/STM32F412xG.svd"/>

