armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32F412_413_423.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00180369.pdf" title="STM32F412 Reference Manual"/>
        <book name="Documentation/DM00213872.pdf" title="STM32F412 Data Sheet"/>

        <feature type="Timer"         n="12"      m="14"/>
        <feature type="SPI"           n="5"       m="37500000"/>
        <feature type="I2C"           n="3"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="USART"         n="4"       m="10500000"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F412CE'  ***************************** -->
        <device Dname="STM32F412CE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Cx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412CEUx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412CG'  ***************************** -->
        <device Dname="STM32F412CG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Cx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412CGUx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412RE'  ***************************** -->
        <device Dname="STM32F412RE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Rx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F412REYx"> <feature type="CSP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412RG'  ***************************** -->
        <device Dname="STM32F412RG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Rx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412RGTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F412RGYx"> <feature type="CSP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412VE'  ***************************** -->
        <device Dname="STM32F412VE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Vx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412VEHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F412VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412VG'  ***************************** -->
        <device Dname="STM32F412VG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Vx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

