armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F412VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F412VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412ZE'  ***************************** -->
        <device Dname="STM32F412ZE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Zx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412ZEJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F412ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412ZG'  ***************************** -->
        <device Dname="STM32F412ZG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Zx"/>

          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F410xx_412xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F412ZGJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F412ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F413'  **************************** -->
      <subFamily DsubFamily="STM32F413">
        <processor Dclock="100000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F413xx"/>
        <debug svd="CMSIS/SVD/STM32F413.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F412_413_423.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00305666.pdf" title="STM32F413/423 Reference Manual"/>
        <book name="Documentation/DM00282249.pdf" title="STM32F413 Data Sheet"/>

        <feature type="I2C"           n="4"/>
        <feature type="USART"         n="3"       m="10500000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F413ZH'  ***************************** -->
        <device Dname="STM32F413ZH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413ZHJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F413ZHTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413CH'  ***************************** -->
        <device Dname="STM32F413CH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413CHUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413RH'  ***************************** -->
        <device Dname="STM32F413RH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413RHTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413VH'  ***************************** -->
        <device Dname="STM32F413VH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413VHHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F413VHTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413MH'  ***************************** -->
        <device Dname="STM32F413MH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413MHYx"> <feature type="CSP" n="81"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413ZG'  ***************************** -->
        <device Dname="STM32F413ZG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413ZGJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F413ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

