armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <!-- *************************  Device 'STM32F413CG'  ***************************** -->
        <device Dname="STM32F413CG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413CGUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413RG'  ***************************** -->
        <device Dname="STM32F413RG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413VG'  ***************************** -->
        <device Dname="STM32F413VG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F413VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F413MG'  ***************************** -->
        <device Dname="STM32F413MG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F413MGYx"> <feature type="CSP" n="81"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F423'  **************************** -->
      <subFamily DsubFamily="STM32F423">
        <processor Dclock="100000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h" define="STM32F423xx"/>
        <debug svd="CMSIS/SVD/STM32F413.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F412_413_423.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00305666.pdf" title="STM32F413/423 Reference Manual"/>
        <book name="Documentation/DM00282247.pdf" title="STM32F423 Data Sheet"/>

        <feature type="I2C"           n="4"/>
        <feature type="USART"         n="3"       m="10500000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F423ZH'  ***************************** -->
        <device Dname="STM32F423ZH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

