armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F423ZHJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F423ZHTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F423CH'  ***************************** -->
        <device Dname="STM32F423CH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F423CHUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F423RH'  ***************************** -->
        <device Dname="STM32F423RH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F423RHTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F423VH'  ***************************** -->
        <device Dname="STM32F423VH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F423VHHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F423VHTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F423MH'  ***************************** -->
        <device Dname="STM32F423MH">
          <memory id="IROM1"                                      start="0x08000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1536.FLM"        start="0x08000000" size="0x00180000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F413xx_423xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="SPI"           n="5"       m="50000000"/>
          <feature type="SDIO"          n="1"       m="4"               name="Secure Digital IO"/>

          <variant Dvariant="STM32F423MHYx"> <feature type="CSP" n="81"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F405'  **************************** -->
      <subFamily DsubFamily="STM32F405">
        <processor Dclock="168000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h" define="STM32F405xx"/>
        <debug svd="CMSIS/SVD/STM32F40x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F405_415_407_417_427_437_429_439.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00031020.pdf" title="STM32F40x/41x/42x/43x Reference Manual"/>
        <book name="Documentation/DM00037051.pdf" title="STM32F405/407 Data Sheet"/>
        <book name="Documentation/DM00037591.pdf" title="STM32F40x/41x Errata Sheet"/>

        <feature type="Timer"         n="12"      m="16"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="37500000"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="10500000"/>
        <feature type="UART"          n="2"       m="10500000"/>
        <feature type="USBOTG"        n="2"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"                           name="Secure Digital IO"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>

        <!-- *************************  Device 'STM32F405RG'  ***************************** -->
        <device Dname="STM32F405RG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>

          <variant Dvariant="STM32F405RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

