armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F429AIHx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429VI'  ***************************** -->
        <device Dname="STM32F429VI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F429VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429ZI'  ***************************** -->
        <device Dname="STM32F429ZI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F429ZITx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F429ZIYx"> <feature type="CSP" n="143"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429II'  ***************************** -->
        <device Dname="STM32F429II">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F429IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F429IIHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429VE'  ***************************** -->
        <device Dname="STM32F429VE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F429VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429ZE'  ***************************** -->
        <device Dname="STM32F429ZE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F429ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429IE'  ***************************** -->
        <device Dname="STM32F429IE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F429IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F429IEHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429BG'  ***************************** -->
        <device Dname="STM32F429BG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>

          <variant Dvariant="STM32F429BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F429BI'  ***************************** -->
        <device Dname="STM32F429BI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>

          <variant Dvariant="STM32F429BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

