armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F437ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F437IG'  ***************************** -->
        <device Dname="STM32F437IG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F437IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F437IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F437AI'  ***************************** -->
        <device Dname="STM32F437AI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="130"/>

          <variant Dvariant="STM32F437AIHx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F437VI'  ***************************** -->
        <device Dname="STM32F437VI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F437VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F437ZI'  ***************************** -->
        <device Dname="STM32F437ZI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F437ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F437II'  ***************************** -->
        <device Dname="STM32F437II">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F437IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F437IIHx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F439'  **************************** -->
      <subFamily DsubFamily="STM32F439">
        <processor Dclock="180000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F439xx"/>
        <debug      svd="CMSIS/SVD/STM32F439x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F405_415_407_417_427_437_429_439.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00031020.pdf" title="STM32F40x/41x/42x/43x Reference Manual"/>
        <book name="Documentation/DM00077036.pdf" title="STM32F437/439 Data Sheet"/>
        <book name="Documentation/DM00068628.pdf" title="STM32F42x/43x Errata Sheet"/>

        <feature type="Timer"         n="12"      m="16"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="6"       m="42000000"/>
        <feature type="ComOther"      n="1"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="4"       m="11250000"/>
        <feature type="USBOTG"        n="2"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1)"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Camera"        n="1"       m="14"/>

        <!-- *************************  Device 'STM32F439VG'  ***************************** -->
        <device Dname="STM32F439VG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F439VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

