armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <!-- *************************  Device 'STM32F439VI'  ***************************** -->
        <device Dname="STM32F439VI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>

          <variant Dvariant="STM32F439VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439ZG'  ***************************** -->
        <device Dname="STM32F439ZG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F439ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439ZI'  ***************************** -->
        <device Dname="STM32F439ZI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>

          <variant Dvariant="STM32F439ZITx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F439ZIYx"> <feature type="CSP" n="143"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439IG'  ***************************** -->
        <device Dname="STM32F439IG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F439IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F439IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439II'  ***************************** -->
        <device Dname="STM32F439II">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <memory id="IRAM2"                                      start="0x10000000" size="0x00010000" init   ="0" default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800" size="0x00000210"             default="0"/>

          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>

          <variant Dvariant="STM32F439IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F439IIHx"> <feature type="BGA" n="176"/> </variant>
        </device>

