armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32F446.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00135183.pdf" title="STM32F446 Reference Manual"/>
        <book name="Documentation/DM00141306.pdf" title="STM32F446 Data Sheet"/>
        <book name="Documentation/DM00155929.pdf" title="STM32F446 Errata Sheet"/>

        <feature type="Timer"         n="12"      m="16"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="4"       m="45000000"/>
        <feature type="ComOther"      n="2"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="2"       m="11250000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="SPI"           n="1"       m="42000000"        name="Queued Serial Peripheral Interface"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Camera"        n="1"       m="14"/>

        <!-- *************************  Device 'STM32F446MC'  ***************************** -->
        <device Dname="STM32F446MC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F446xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F446MCYx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F446RC'  ***************************** -->
        <device Dname="STM32F446RC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F446xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F446RCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F446VC'  ***************************** -->
        <device Dname="STM32F446VC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F446xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F446VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F446ZC'  ***************************** -->
        <device Dname="STM32F446ZC">
          <memory id="IROM1"                                start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F446xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F446ZCHx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F446ZCTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F446ME'  ***************************** -->
        <device Dname="STM32F446ME">
          <memory id="IROM1"                                start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F446xx_OPT.FLM" start="0x1FFFC000" size="0x00000004"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800" size="0x00000210"             default="0"/>

          <variant Dvariant="STM32F446MEYx"> <feature type="QFP" n="100"/> </variant>
        </device>

