armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F469IGHx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F469IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469II'  ***************************** -->
        <device Dname="STM32F469II">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469IIHx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F469IITx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BE'  ***************************** -->
        <device Dname="STM32F469BE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469BETx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BG'  ***************************** -->
        <device Dname="STM32F469BG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BI'  ***************************** -->
        <device Dname="STM32F469BI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NE'  ***************************** -->
        <device Dname="STM32F469NE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469NEHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NG'  ***************************** -->
        <device Dname="STM32F469NG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NI'  ***************************** -->
        <device Dname="STM32F469NI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469VE'  ***************************** -->
        <device Dname="STM32F469VE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

