armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
          <variant Dvariant="STM32F469VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469VG'  ***************************** -->
        <device Dname="STM32F469VG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469VI'  ***************************** -->
        <device Dname="STM32F469VI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469ZE'  ***************************** -->
        <device Dname="STM32F469ZE">
          <memory id="IROM1"                                      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469ZG'  ***************************** -->
        <device Dname="STM32F469ZG">
          <memory id="IROM1"                                      start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_1024dual.FLM"    start="0x08000000" size="0x00100000"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469ZI'  ***************************** -->
        <device Dname="STM32F469ZI">
          <memory id="IROM1"                                      start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                                      start="0x20000000" size="0x00050000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000" size="0x00200000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F469xx_479xx_OPT.FLM" start="0x1FFFC000" size="0x00000008"             default="0"/>
          <algorithm name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000" size="0x02000000"             default="1"/>

          <variant Dvariant="STM32F469ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F479'  **************************** -->
      <subFamily DsubFamily="STM32F479">
        <processor Dclock="180000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h" define="STM32F479xx"/>
        <debug svd="CMSIS/SVD/STM32F46_79x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F469_479.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00127514.pdf" title="STM32F469/479 Reference Manual"/>
        <book name="Documentation/DM00208574.pdf" title="STM32F479 Data Sheet"/>

        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="3"       m="12"/>
        <feature type="SPI"           n="6"       m="42000000"/>
        <feature type="ComOther"      n="1"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="4"       m="11250000"/>
        <feature type="USBOTG"        n="2"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1, SHA-2) and HMAC"/>
        <feature type="Camera"        n="1"       m="14"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

