armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <board vendor="STMicroelectronics" name="STM32F4-Discovery" revision="Rev.C.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F4DISCOVERY">
      <description>STMicroelectronics STM32F4-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4_discovery_small.jpg" large="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4_discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF252419" title="STM32F4-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/DM00037368.pdf" title="Getting Started"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/32F4-DISCOVERY_QSG.pdf" title="STM32F4-Discovery Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F4-Discovery/Documentation/DM00039084.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F407VG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F407"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F417"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F405"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F415"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="DIO"       n="100"            name="Extension header: 4 x 25 for LQFP100 with 2.54 mm Pitch"/>
      <feature type="USB"       n="1"              name="High-Speed USB OTG with micro-AB Connector"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Accelerometer" n="1"          name="LIS302DL or LIS3DSH ST MEMS 3-axis accelerometer"/>
      <feature type="LineOut"   n="1"              name="CS43L22: audio DAC with integrated class D speaker driver"/>
      <feature type="ConnOther" n="1"              name="JP1 (Idd) for current measurement"/>
      <feature type="ConnOther" n="1"              name="MP45DT02: audio sensor, omnidirectional digital microphone"/>
      <feature type="LED"       n="8"              name="LEDs: USB COM, 3.3 V Power, Four user, Two USB OTG LEDs"/>
      <feature type="CustomFF"  n="66" m="97"      name="Discovery Board Formfactor"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32F429I-Discovery" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F429I-DISCO">
      <description>STMicroelectronics STM32F429I-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_small.png" large="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco.png"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF259090" title="STM32F429I-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/DM00092920.pdf" title="Getting Started"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/32F429IDISCOVERY_QSG.pdf" title="STM32F429I-Discovery Quick Start Guide"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/STMicroelectronics_Blinky_Lab.pdf" title="STM32F429I-Discovery: Blinky Lab"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/DM00093903.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F429ZI"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F427"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F429"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F437"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F439"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="RAM"       n="1"              name="64 MBit SDRAM"/>
      <feature type="DIO"       n="128"            name="Extension header: 4 x 32 for LQFP144 with 2.54 mm Pitch"/>
      <feature type="USB"       n="1"              name="High-Speed USB OTG with micro-AB Connector"/>
      <feature type="ConnOther" n="1"              name="JP3 (Idd) for current measurement"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Gyro"      n="1"              name="L3GD20, ST MEMS motion sensor, 3-axis digital output gyroscope"/>
      <feature type="LED"       n="6"              name="LEDs: COM, 3.3 V Power, Two user, Two USB OTG LEDs"/>
      <feature type="CustomFF"  n="66" m="119.3"   name="Discovery Board Formfactor"/>
      <feature type="GLCD"      n="1"  m="240.320" name="2.4 inch QVGA TFT LCD"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <board vendor="STMicroelectronics" name="32F469IDISCOVERY" revision="Rev.B.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics 32F469IDISCOVERY Board Support and Examples</description>
      <image small="MDK/Boards/ST/32F469IDISCOVERY/Documentation/32f469idiscovery_small.png" large="MDK/Boards/ST/32F469IDISCOVERY/Documentation/32f469idiscovery.png"/>
      <book category="overview"  name="http://http://www.st.com/en/evaluation-tools/32f469idiscovery.html" title="32F469IDISCOVERY Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/32F469IDISCOVERY/Documentation/DM00218382.pdf" title="Data brief"/>
      <book category="setup"     name="MDK/Boards/ST/32F469IDISCOVERY/Documentation/DM00236781.pdf" title="Getting started"/>
      <book category="manual"    name="MDK/Boards/ST/32F469IDISCOVERY/Documentation/DM00218846.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F469NI"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F469"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F479"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="RAM"       n="1"              name="4Mx32bit SDRAM"/>
      <feature type="DIO"       n="32"             name="Expansion connectors and Arduino UNO V3 connectors"/>
      <feature type="LineOut"   n="2"              name="SAI Audio DAC, with a stereo headphone output jack "/>
      <feature type="MIC"       n="2"              name="ST MEMS microphones"/>
      <feature type="USB"       n="1"              name="USB OTG FS with micro-AB Connector"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="LED"       n="8"              name="LEDs: COM, Power, 4 user, Two USB OTG LEDs"/>
      <feature type="GLCD"      n="1"  m="800.480" name="4 inches 800x480 pixel TFT"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
  </boards>

  <conditions>
    <condition id="STM32F4">
      <description>STMicroelectronics STM32F4 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F4*"/>
    </condition>
