armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F410_446">
      <description>STMicroelectronics STM32F410/446 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F446xx"/>
    </condition>
    <condition id="STM32F410_412_446">
      <description>STMicroelectronics STM32F410/412/446 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F446xx"/>
    </condition>
    <condition id="STM32F410_412_446_4x3">
      <description>STMicroelectronics STM32F410/412/446/413/423 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x_4x3">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F410_40_41_412_42_43_44_46_47x">
      <description>STMicroelectronics STM32F410/405/407/412/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F410_40_41_412_42_43_44_46_47x_4x3">
      <description>STMicroelectronics STM32F410/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>

    <condition id="STM32F4_ARMCC">
      <description>filter for STM32F4 devices and the ARM compiler</description>
      <require condition="STM32F4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F4_IAR">
      <description>filter for STM32F4 devices and the ARM compiler</description>
      <require condition="STM32F4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F4_GCC">
      <description>filter for STM32F4 devices and the ARM compiler</description>
      <require condition="STM32F4"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F401_ARMCC">
      <description>filter for STM32F401 devices and the ARM compiler</description>
      <require condition="STM32F401"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F411_ARMCC">
      <description>filter for STM32F411 devices and the ARM compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F40x_41x_ARMCC">
      <description>filter for STM32F405/407/415/417 devices and the ARM compiler</description>
      <require condition="STM32F40_41x"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F42x_43x_ARMCC">
      <description>filter for STM32F427/429/437/439 devices and the ARM compiler</description>
      <require condition="STM32F42_43x"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410_412_ARMCC">
      <description>filter for STM32F410/412 devices and the ARM compiler</description>
      <accept condition="STM32F410xx"/>
      <accept condition="STM32F412xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F413_423_ARMCC">
      <description>filter for STM32F413/423 devices and the ARM compiler</description>
      <accept condition="STM32F413xx"/>
      <accept condition="STM32F423xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F446_ARMCC">
      <description>filter for STM32F446 devices and the ARM compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F469_479_ARMCC">
      <description>filter for STM32F469/479 devices and the ARM compiler</description>
      <accept condition="STM32F469xx"/>
      <accept condition="STM32F479xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F401xC_ARMCC">
      <description>filter for STM32F401xB/C devices and the ARM compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F401xC_GCC">
      <description>filter for STM32F401xB/C devices and the GCC compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="GCC"/>
    </condition>
