armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F401xC_IAR">
      <description>filter for STM32F401xB/C devices and the IAR compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F401xE_ARMCC">
      <description>filter for STM32F401xD/E devices and the ARM compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F401xE_GCC">
      <description>filter for STM32F401xD/E devices and the GCC compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F401xE_IAR">
      <description>filter for STM32F401xD/E devices and the IAR compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Cx_ARMCC">
      <description>filter for STM32F410Cx devices and the ARM compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Cx_GCC">
      <description>filter for STM32F410Cx devices and the GCC compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Cx_IAR">
      <description>filter for STM32F410Rx devices and the IAR compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Rx_ARMCC">
      <description>filter for STM32F410Rx devices and the ARM compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Rx_GCC">
      <description>filter for STM32F410Rx devices and the GCC compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Rx_IAR">
      <description>filter for STM32F410Rx devices and the IAR compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Tx_ARMCC">
      <description>filter for STM32F410Tx devices and the ARM compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Tx_GCC">
      <description>filter for STM32F410Tx devices and the GCC compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Tx_IAR">
      <description>filter for STM32F410Tx devices and the IAR compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F411xE_ARMCC">
      <description>filter for STM32F411xC/E devices and the ARM compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F411xE_GCC">
      <description>filter for STM32F411xC/E devices and the GCC compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F411xE_IAR">
      <description>filter for STM32F411xC/E devices and the IAR compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Cx_ARMCC">
      <description>filter for STM32F412Cx devices and the ARM compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Cx_GCC">
      <description>filter for STM32F412Cx devices and the GCC compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Cx_IAR">
      <description>filter for STM32F412Cx devices and the IAR compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Rx_ARMCC">
      <description>filter for STM32F412Rx devices and the ARM compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Rx_GCC">
      <description>filter for STM32F412Rx devices and the GCC compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Rx_IAR">
      <description>filter for STM32F412Rx devices and the IAR compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Vx_ARMCC">
      <description>filter for STM32F412Vx devices and the ARM compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Vx_GCC">
      <description>filter for STM32F412Vx devices and the GCC compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Vx_IAR">
      <description>filter for STM32F412Vx devices and the IAR compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Zx_ARMCC">
      <description>filter for STM32F412Zx devices and the ARM compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Zx_GCC">
      <description>filter for STM32F412Zx devices and the GCC compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Zx_IAR">
      <description>filter for STM32F412Zx devices and the IAR compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="IAR"/>
    </condition>

