armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F405xx_ARMCC">
      <description>filter for STM32F405xx devices and the ARM compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F405xx_GCC">
      <description>filter for STM32F405xx devices and the GCC compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F405xx_IAR">
      <description>filter for STM32F405xx devices and the IAR compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F407xx_ARMCC">
      <description>filter for STM32F407xx devices and the ARM compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F407xx_GCC">
      <description>filter for STM32F407xx devices and the GCC compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F407xx_IAR">
      <description>filter for STM32F407xx devices and the IAR compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F415xx_ARMCC">
      <description>filter for STM32F415xx devices and the ARM compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F415xx_GCC">
      <description>filter for STM32F415xx devices and the GCC compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F415xx_IAR">
      <description>filter for STM32F415xx devices and the IAR compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F417xx_ARMCC">
      <description>filter for STM32F417xx devices and the ARM compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F417xx_GCC">
      <description>filter for STM32F417xx devices and the GCC compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F417xx_IAR">
      <description>filter for STM32F417xx devices and the IAR compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F427xx_ARMCC">
      <description>filter for STM32F427xx devices and the ARM compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F427xx_GCC">
      <description>filter for STM32F427xx devices and the GCC compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F427xx_IAR">
      <description>filter for STM32F427xx devices and the IAR compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F429xx_ARMCC">
      <description>filter for STM32F429xx devices and the ARM compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F429xx_GCC">
      <description>filter for STM32F429xx devices and the GCC compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F429xx_IAR">
      <description>filter for STM32F429xx devices and the IAR compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F437xx_ARMCC">
      <description>filter for STM32F437xx devices and the ARM compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F437xx_GCC">
      <description>filter for STM32F437xx devices and the GCC compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F437xx_IAR">
      <description>filter for STM32F437xx devices and the IAR compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F439xx_ARMCC">
      <description>filter for STM32F439xx devices and the ARM compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F439xx_GCC">
      <description>filter for STM32F439xx devices and the GCC compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F439xx_IAR">
      <description>filter for STM32F439xx devices and the IAR compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F446xx_ARMCC">
      <description>filter for STM32F446xx devices and the ARM compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F446xx_GCC">
      <description>filter for STM32F446xx devices and the GCC compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F446xx_IAR">
      <description>filter for STM32F446xx devices and the IAR compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F469xx_ARMCC">
      <description>filter for STM32F469xx devices and the ARM compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F469xx_GCC">
      <description>filter for STM32F469xx devices and the GCC compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F469xx_IAR">
      <description>filter for STM32F469xx devices and the IAR compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="IAR"/>
    </condition>

