armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F479xx_ARMCC">
      <description>filter for STM32F479xx devices and the ARM compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F479xx_GCC">
      <description>filter for STM32F479xx devices and the GCC compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F479xx_IAR">
      <description>filter for STM32F479xx devices and the IAR compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F413xx_ARMCC">
      <description>filter for STM32F413xx devices and the ARM compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F413xx_GCC">
      <description>filter for STM32F413xx devices and the GCC compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F413xx_IAR">
      <description>filter for STM32F413xx devices and the IAR compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F423xx_ARMCC">
      <description>filter for STM32F423xx devices and the ARM compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F423xx_GCC">
      <description>filter for STM32F423xx devices and the GCC compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F423xx_IAR">
      <description>filter for STM32F413xx devices and the IAR compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="IAR"/>
    </condition>


    <condition id="STM32F4 CMSIS">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F4 CMSIS RTOS">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with RTOS</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
    </condition>
    <condition id="STM32F4 CMSIS RTOS I2C_Driver">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with RTOS and I2C Driver</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept  Cclass="CMSIS" Cgroup="RTOS"/>
      <accept  Cclass="CMSIS" Cgroup="RTOS2"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    <condition id="STM32F4 CMSIS I2C_Driver">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with I2C Driver</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="STM32F4 Framework Classic">
      <description>STM32CubeF4 Classic Framework</description>
      <require condition="STM32F4 HAL Common"/>
    </condition>

    <condition id="STM32F4 HAL Common">
      <description>STMicroelectronics STM32F4 Device and HAL Common</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>

    <condition id="STM32F4 HAL">
      <description>STMicroelectronics STM32F4 Device and HAL</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_42_43x HAL">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439 Device and HAL</description>
      <require condition="STM32F40_41_42_43x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x_4x3 HAL">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F42_43x HAL">
      <description>STMicroelectronics STM32F427/429/437/439 Device and HAL</description>
      <require condition="STM32F42_43x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F42_43_46_47x HAL">
      <description>STMicroelectronics STM32F427/429/437/439/469/479 Device and HAL</description>
      <require condition="STM32F42_43_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F46_47x HAL">
      <description>STMicroelectronics STM32F469/479 Series Device and HAL</description>
      <require condition="STM32F46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x7_9 HAL">
      <description>STMicroelectronics STM32F417/427/429/437/439/469/479 Device and HAL</description>
      <require condition="STM32F4x7_9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x9 HAL">
      <description>STMicroelectronics STM32F429/439/469/479 Device and HAL</description>
      <require condition="STM32F4x9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
