armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F446 HAL">
      <description>STMicroelectronics STM32F446 Device and HAL</description>
      <require condition="STM32F446xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F401/411/405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F4x1_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x_4x3 HAL">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410 HAL">
      <description>STMicroelectronics STM32F410 Device and HAL</description>
      <require condition="STM32F410xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_4x3 HAL">
      <description>STMicroelectronics STM32F410/413/423 Device and HAL</description>
      <require condition="STM32F410_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F412 HAL">
      <description>STMicroelectronics STM32F412 Device and HAL</description>
      <require condition="STM32F412xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F412_4x3 HAL">
      <description>STMicroelectronics STM32F412/413/423 Device and HAL</description>
      <require condition="STM32F412_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F410_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_40_41_412_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F410/405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F410_40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_40_41_412_42_43_44_46_47x_4x3 HAL">
      <description>STMicroelectronics STM32F410/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL</description>
      <require condition="STM32F410_40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>

    <condition id="STM32F4 HAL GPIO">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32F4 HAL GPIO ADC">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO and ADC</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>
    <condition id="STM32F4 HAL GPIO SRAM">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO and SRAM</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
    </condition>
    <condition id="STM32F4 HAL DMA">
      <description>STMicroelectronics STM32F4 Device and HAL with DMA</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <condition id="STM32F40_41_42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x_4x3 HAL DMA">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL with DMA</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F41_43_47x HAL DMA">
      <description>STMicroelectronics STM32F415/417/437/439/479 Device and HAL with DMA</description>
      <require condition="STM32F41_43_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F42_43_44_46_47x_4x3 HAL DMA">
      <description>STMicroelectronics STM32F427/429/437/439/446/469/479/413/423 Device and HAL with DMA</description>
      <require condition="STM32F42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F412_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F412/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F412_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F412_44_46_47x_4x3 HAL DMA">
      <description>STMicroelectronics STM32F412/446/469/479/413/423 Device and HAL with DMA</description>
      <require condition="STM32F412_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F4x7_9_6 HAL DMA">
      <description>STMicroelectronics STM32F417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F4x7_9_6"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F446 HAL DMA">
      <description>STMicroelectronics STM32F446 Device and HAL with DMA</description>
      <require condition="STM32F446xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F4x1_40_41_42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F401/411/405/407/415/417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F4x1_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x_4x3 HAL DMA">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL with DMA</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
