armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <condition id="STM32F410_446 HAL DMA">
      <description>STMicroelectronics STM32F410/446 Device and HAL with DMA</description>
      <require condition="STM32F410_446"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F410_412_446 HAL DMA">
      <description>STMicroelectronics STM32F410/412/446 Device and HAL with DMA</description>
      <require condition="STM32F410_412_446"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F410_412_446_4x3 HAL DMA">
      <description>STMicroelectronics STM32F410/412/446/413/423 Device and HAL with DMA</description>
      <require condition="STM32F410_412_446_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x HAL DMA">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479 Device and HAL with DMA</description>
      <require condition="STM32F410_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x_4x3 HAL DMA">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479/423/423 Device and HAL with DMA</description>
      <require condition="STM32F410_40_41_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <condition id="STM32F4 HAL DMA RCC">
      <description>STMicroelectronics STM32F4 Device and HAL with DMA and RCC</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
    </condition>
    <condition id="STM32F4 HAL GPIO DMA DCMI I2C_Driver">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO, DMA, DCMI and CMSIS I2C Driver</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    <condition id="STM32F4 HAL GPIO SRAM LCD_16">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO and SRAM and LCD (16-bit IF)</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Graphics"     Cgroup="Display" Cvariant="16-bit IF"/>
    </condition>
    <condition id="STM32F4 HAL GPIO SPI_Driver LCD_RGB">
      <description>STMicroelectronics STM32F4 Device and HAL with GPIO and CMSIS SPI Driver and LCD (RGB IF)</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32F429I-Discovery" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32F4 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>STMicroelectronics STM32F4 Device and HAL with LTDC and DMA2D and Graphics with LCD (RGB IF)</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32F4 HAL LTDC DMA2D DSI OTM8009A Graphics LCD_RGB">
      <description>STMicroelectronics STM32F4 Device and HAL with LTDC and DMA2D and Graphics with LCD (RGB IF)</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="RGB IF"/>
    </condition>
    
    <!-- 32F469IDISCOVERY Board condition -->
    <condition id="32F469IDISCOVERY BSP">
      <description>STMicroelectronics 32F469IDISCOVERY BSP</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
    <condition id="32F469IDISCOVERY BSP Audio">
      <description>STMicroelectronics 32F469IDISCOVERY BSP Audio</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="32F469IDISCOVERY BSP EEPROM">
      <description>STMicroelectronics 32F469IDISCOVERY BSP EEPROM</description>
      <require condition="STM32F4"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
