armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
  </conditions>

  <examples>
    <!-- STM32F401C Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F401C-Discovery/Blinky" version="1.0.0">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F401C-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32F4 Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F4-Discovery/Blinky" version="1.0.0">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F4-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32F429I Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Blinky" version="1.0.0">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/emWin/Example" version="1.0.0">
      <description>emWin Graphics simple example</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/emWin/GUIDemo" version="1.0.0">
      <description>emWin Graphics Demo example</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Middleware/USB/Device/HID" version="1.0.1">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Middleware/USB/Device/MassStorage" version="1.0.1">
      <description>USB Mass Storage Device using RAM as storage media</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Device WinUSB Echo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Middleware/USB/Device/WinUSB_Echo" version="1.0.0">
      <description>WinUSB Class Device echoing bulk endpoint data (implemented as Custom Class)</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="WinUSB_Echo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="Custom Class"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>WinUSB_Echo</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Middleware/USB/Host/MassStorage" version="1.0.1">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format the storage device</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F429I-Discovery/Middleware/USB/Host/Keyboard" version="1.0.1">
      <description>USB HID Keyboard as input device</description>
      <board name="STM32F429I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>
    
