armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <!-- 32F469IDISCOVERY Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/Blinky" version="1.0.0">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/emWin/Example" version="1.0.0">
      <description>emWin Graphics simple example</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/emWin/GUIDemo" version="1.0.0">
      <description>emWin Graphics Demo example</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/Middleware/USB/Device/HID" version="1.0.1">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/Middleware/USB/Device/MassStorage" version="1.0.1">
      <description>USB Mass Storage Device using RAM as storage media</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/Middleware/USB/Host/MassStorage" version="1.0.1">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format the storage device</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="MDK/Boards/ST/32F469IDISCOVERY/Middleware/USB/Host/Keyboard" version="1.0.1">
      <description>USB HID Keyboard as input device</description>
      <board name="32F469IDISCOVERY" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>

    <!-- MCBSTM32F400 Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Blinky" version="1.0.0">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky with STM32CubeMX" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/CubeMX/Blinky" version="1.0.0">
      <description>CMSIS-RTOS Blinky example configured with STM32CubeMX</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Demo" version="1.0.0">
      <description>Demo example</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/emWin/Example" version="1.0.0">
      <description>emWin Graphics simple example</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/emWin/GUIDemo" version="1.0.0">
      <description>emWin Graphics Demo example</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

