armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <example name="HTTP Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Middleware/Network/HTTP_Server" version="1.0.0">
      <description>Compact Web Server with CGI interface</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Upload IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Middleware/Network/HTTP_Upload" version="1.0.0">
      <description>Web Server with CGI interface and SD/MMC Memory Card as storage media</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Upload.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Middleware/Network/SMTP_Client" version="1.0.0">
      <description>Example showing how to compose and send emails</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Middleware/Network/SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/Keil/MCBSTM32F400/Middleware/Network/Telnet_Server" version="1.0.0">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="MCBSTM32F400" vendor="Keil"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>
  </examples>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL" doc="Documentation/DM00105879.pdf" >STM32F4xx Hardware Abstraction Layer (HAL) Drivers</description>
    <description Cclass="Graphics Display">Display Interface including configuration for emWIN</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.0.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.6.2" condition="STM32F4 CMSIS">  <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F4 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F4XX    /* Device Startup for STM32F4 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32F4xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32F401_ARMCC"     name="MDK/Device/Source/ARM/STM32F401xx_OPT.s"       attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F411_ARMCC"     name="MDK/Device/Source/ARM/STM32F411xx_OPT.s"       attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F410_412_ARMCC" name="MDK/Device/Source/ARM/STM32F410xx_412xx_OPT.s" attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F413_423_ARMCC" name="MDK/Device/Source/ARM/STM32F413xx_423xx_OPT.s" attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F40x_41x_ARMCC" name="MDK/Device/Source/ARM/STM32F40xxx_41xxx_OPT.s" attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F42x_43x_ARMCC" name="MDK/Device/Source/ARM/STM32F42xxx_43xxx_OPT.s" attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F446_ARMCC"     name="MDK/Device/Source/ARM/STM32F446xx_OPT.s"       attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F469_479_ARMCC" name="MDK/Device/Source/ARM/STM32F469xx_479xx_OPT.s" attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F4_ARMCC"       name="MDK/Device/Source/ARM/STM32F4xx_OTP.s"         attr="template"  select="Flash One-Time programmable Bytes"/>

        <file category="header" name="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32F401xC_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f401xc.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F401xE_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f401xe.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F405xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f405xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F407xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f407xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Cx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f410cx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Rx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f410rx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Tx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f410tx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F411xE_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f411xe.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Cx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f412cx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Rx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f412rx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Vx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f412vx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Zx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f412zx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F415xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f415xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F417xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f417xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F427xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f427xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F429xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f429xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F437xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f437xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F439xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f439xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F446xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f446xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F469xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f469xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F479xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f479xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F413xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f413xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F423xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/arm/startup_stm32f423xx.s" attr="config" version="2.6.2"/>
        <!-- GCC Toolchain -->
        <file category="source" condition="STM32F401xC_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f401xc.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F401xE_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f401xe.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F405xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f405xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F407xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f407xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Cx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f410cx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Rx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f410rx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Tx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f410tx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F411xE_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f411xe.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Cx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f412cx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Rx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f412rx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Vx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f412vx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Zx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f412zx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F415xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f415xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F417xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f417xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F427xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f427xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F429xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f429xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F437xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f437xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F439xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f439xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F446xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f446xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F469xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f469xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F479xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f479xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F413xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f413xx.S" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F423xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/gcc/startup_stm32f423xx.S" attr="config" version="2.6.2"/>
        <!-- IAR Toolchain -->
        <file category="source" condition="STM32F401xC_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f401xc.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F401xE_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f401xe.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F405xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f405xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F407xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f407xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Cx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f410cx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Rx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f410rx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F410Tx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f410tx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F411xE_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f411xe.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Cx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f412cx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Rx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f412rx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Vx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f412vx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F412Zx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f412zx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F415xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f415xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F417xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f417xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F427xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f427xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F429xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f429xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F437xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f437xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F439xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f439xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F446xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f446xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F469xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f469xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F479xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f479xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F413xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f413xx.s" attr="config" version="2.6.2"/>
        <file category="source" condition="STM32F423xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/iar/startup_stm32f423xx.s" attr="config" version="2.6.2"/>

        <!-- system file -->
        <file category="source" name="Drivers/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xx.c" attr="config" version="2.6.2"/>
      </files>
    </component>

