armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1" Cversion="2.19" condition="STM32F4 CMSIS_Driver USB0">
      <description>USB Device Full-Speed Driver for STM32F4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_FS_STM32F4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="High-speed" Capiversion="2.1" Cversion="2.19" condition="STM32F4 CMSIS_Driver USB1">
      <description>USB Device High-Speed Driver for STM32F4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_HS_STM32F4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Csub="Full-speed" Capiversion="2.0" Cversion="2.21" condition="STM32F4 CMSIS_Driver USB0">
      <description>USB Host Full-Speed Driver for STM32F4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_FS_STM32F4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Csub="High-speed" Capiversion="2.0" Cversion="2.22" condition="STM32F4 CMSIS_Driver USB1">
      <description>USB Host High-Speed Driver for STM32F4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS_STM32F4xx.c"/>
      </files>
    </component>

    <!-- MCBSTM32F400 Development Board -->
    <bundle Cbundle="MCBSTM32F400" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32F400</description>
      <doc>MDK/Boards/Keil/MCBSTM32F400/Documentation/mcbstm32f200.chm</doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>LED Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/LED_MCBSTM32F400.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Buttons_MCBSTM32F400.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F4 HAL GPIO ADC">
        <description>A/D Converter Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/ADC_MCBSTM32F400.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Joystick Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Joystick_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.1" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Accelerometer" Capiversion="1.0.0" condition="STM32F4 CMSIS I2C_Driver">
        <description>Accelerometer Interface for LIS3DH</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Accelerometer_LIS3DH.c"/>
        </files>
      </component>
      <component Cgroup="Gyroscope" Capiversion="1.0.0" condition="STM32F4 CMSIS I2C_Driver">
        <description>Gyroscope Interface for L3G4200D</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Gyroscope_L3G4200D.c"/>
        </files>
      </component>
      <component Cgroup="Camera" Capiversion="1.0.0" condition="STM32F4 HAL GPIO DMA DCMI I2C_Driver">
        <description>Camera Interface for OVM7690</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/Camera_OVM7690.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F4 HAL GPIO SRAM">
        <description>Graphic LCD Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="header" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/GLCD_MCBSTM32F400.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="16-bit IF" condition="STM32F4 HAL GPIO SRAM LCD_16">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32F400 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F400/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F4-Discovery Board -->
    <bundle Cbundle="STM32F4-Discovery" Cclass="Board Support" Cversion="2.0.0">
      <description>STMicroelectronics STM32F4 Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00037955.pdf</doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F4-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F4-Discovery/Common/LED_F4Discovery.c"/>
        </files>
      </component>
