armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F4-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F4-Discovery/Common/Buttons_F4Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F401C-Discovery Board -->
    <bundle Cbundle="STM32F401C-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F401C-Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00094495.pdf</doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F401C-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F401C-Discovery/Common/LED_F401Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F401C-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F401C-Discovery/Common/Buttons_F401Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F429I-Discovery Board -->
    <bundle Cbundle="STM32F429I-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F429I-Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00094498.pdf</doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LED_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Buttons_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.1" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="STM32F4 HAL GPIO SPI_Driver LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32F429I-Discovery" Cvariant="RGB IF" Cversion="1.0.2" condition="STM32F4 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32F429I-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCDConf.c" attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- 32F469IDISCOVERY Board -->
    <bundle Cbundle="32F469IDISCOVERY" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics 32F469IDISCOVERY Kit</description>
      <doc>http://www.st.com/resource/en/data_brief/32f469idiscovery.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O" condition="32F469IDISCOVERY BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="32F469IDISCOVERY BSP Audio">
        <description>Audio for STMicroelectronics 32F469IDISSCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/cs43l22/cs43l22.c"/>
          <file category="library" condition="STM32F4_ARMCC" name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM4_Keil.lib"/>
          <file category="library" condition="STM32F4_GCC"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM4_GCC.a"/>
          <file category="library" condition="STM32F4_IAR"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM4_IAR.a"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="32F469IDISCOVERY BSP EEPROM">
        <description>EERPOM for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="32F469IDISCOVERY BSP LCD">
        <description>LCD for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI" condition="32F469IDISCOVERY BSP QSPI">
        <description>QSPI Flash for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="32F469IDISCOVERY BSP SD">
        <description>uSD for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_sd.c"/>
        </files>
      </component>
