armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F4xx/Keil.STM32F4xx_DFP.pdsc
      <component Cgroup="Drivers" Csub="SDRAM" condition="32F469IDISCOVERY BSP SDRAM">
        <description>SDRAM for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="32F469IDISCOVERY BSP TS">
        <description>Touch Screen for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32469I-Discovery/stm32469i_discovery_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft6x06/ft6x06.c"/>
        </files>
      </component>

      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/LED_32F469IDISCOVERY.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/Buttons_32F469IDISCOVERY.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="32F469IDISCOVERY GLCD">
        <description>Graphic LCD interface for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="header" name="MDK/Boards/ST/32F469IDISCOVERY/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/GLCD_32F469IDISCOVERY.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.1" condition="32F469IDISCOVERY TS">
        <description>Touchscreen Interface for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/Touch_32F469IDISCOVERY.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.0.0" Cvariant="RGB IF" condition="32F469IDISCOVERY LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics 32F469IDISCOVERY Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/LCD_X.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
          <file category="header" name="Drivers/BSP/Components/otm8009a/otm8009a.h"/>
        </files>
      </component>
    </bundle> 
    <component Cclass="Graphics Display" Cgroup="32F469IDISCOVERY" Cvariant="RGB IF" Cversion="1.0.0" condition="STM32F4 HAL LTDC DMA2D DSI OTM8009A Graphics LCD_RGB">
      <description>LCD Configuration for 32F469IDISCOVERY LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/32F469IDISCOVERY/Common/LCDConf.c" attr="config" version="1.0.2"/>
      </files>
    </component>    
    
  </components>
</package>
